#3. Довжина маршруту велоралі "100 кілометрів за 10 годин" - приблизно 100 кілометрів. Велосипедист Вася стартує з нульового кілометра маршруту та їде зі швидкістю `v` кілометрів на годину. На якій відмітці він зупиниться через `t` годин?
#Програма отримує на вхід значення `v` та `t`. Якщо `v > 0`, то Вася рухається у позитивному напрямку за маршрутом, якщо ж значення `v < 0`, то негативному.
#Програма має вивести ціле число від 0 до 100 – номер позначки, на якій зупиниться Вася.



#V - швидкість руху
#T - години


V = input("Яка була швидкість руху Васяна?: ")

T = input("через скільки годин Васьок зупиниться?: ")


V_integer = int(V)

T_integer = int(T)

S_input = V_integer * T_integer

if V_integer > 0:

     if S_input <= 100:
         print( "Васьочок зупиниться на позначці " + str(S_input) + " км")
     else:
         print("Васьок вже проїхав 100-й кілометр")
else:
     print("Васьок рухається у негативному напрямку. Game over!Пиу! Пиу!")



