
#Дано натуральне число. Потрібно визначити, чи є рік із цим числом високосним. Якщо рік є високосним, то виведіть `YES`, інакше виведіть `NO`. Нагадаємо, що відповідно до григоріанського календаря, рік є високосним, якщо його номер кратний 4, але не кратний 100, а також якщо він кратний 400.

year = int(input("Який рік ви хочете перевірити? "))

if year % 4 == 0:
  if year % 100 == 0:
    if year % 400 == 0:
      print("Цей рік є високосним.")
    else:
      print("Це не високосний рік.")
  else:
    print("Цей рік високосний.")
else:
  print("Це не високосний рік.")